Documents/ПланированиеПродажМенеджеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ПланированиеПродажМенеджеров</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ПланПродажМенеджеров</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Год</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МенеджерПродаж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>План</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Январь</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Февраль</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Март</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Апрель</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Май</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Июнь</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Июль</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Август</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сентябрь</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Октябрь</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ноябрь</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Декабрь</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ПланПродажМенеджеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ПланПродажМенеджеров</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Год</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Месяц</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МенеджерПродаж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ПланированиеПродажМенеджеров/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	//проверим, был ли введен по данному году и менеджеру документ ранее
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПланированиеПродажМенеджеров.Ссылка
	|ИЗ
	|	Документ.ПланированиеПродажМенеджеров КАК ПланированиеПродажМенеджеров
	|ГДЕ
	|	ПланированиеПродажМенеджеров.Год = &Год
	|	И ПланированиеПродажМенеджеров.Проведен = ИСТИНА
	|	И ПланированиеПродажМенеджеров.Ссылка <> &Ссылка
	|	И ПланированиеПродажМенеджеров.МенеджерПродаж = &МенеджерПродаж";
	Запрос.УстановитьПараметр("Год",Год);
	Запрос.УстановитьПараметр("МенеджерПродаж",МенеджерПродаж);
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	ВыборкаЗапроса = Запрос.Выполнить().Выбрать();
	Пока ВыборкаЗапроса.Следующий() Цикл
		Отказ = Истина;
		Сообщить("По данному году и менеджеру уже имеется проведенный документ плана: " + ВыборкаЗапроса.Ссылка,СтатусСообщения.Важное);
	КонецЦикла;
	Если Отказ Тогда 
		Возврат;
	КонецЕсли;
	
	//запишем новые
	Движения.ПланПродажМенеджеров.Записывать = Истина;
	Для Каждого СтрокаПлан Из План Цикл
		Движение = Движения.ПланПродажМенеджеров.Добавить();
		НомерМесяц = 1;
		Движение.МенеджерПродаж = МенеджерПродаж;
		Движение.Год = Год;
		Движение.Месяц = НачалоМесяца(Дата(Год,НомерМесяц,1,0,0,1));
		Движение.Номенклатура = СтрокаПлан.Номенклатура;
		Движение.Количество = СтрокаПлан.Январь;
		
		Движение = Движения.ПланПродажМенеджеров.Добавить();
		НомерМесяц = 2;
		Движение.МенеджерПродаж = МенеджерПродаж;
		Движение.Год = Год;
		Движение.Месяц = НачалоМесяца(Дата(Год,НомерМесяц,1,0,0,1));
		Движение.Номенклатура = СтрокаПлан.Номенклатура;
		Движение.Количество = СтрокаПлан.Февраль;
		
		Движение = Движения.ПланПродажМенеджеров.Добавить();
		НомерМесяц = 3;
		Движение.МенеджерПродаж = МенеджерПродаж;
		Движение.Год = Год;
		Движение.Месяц = НачалоМесяца(Дата(Год,НомерМесяц,1,0,0,1));
		Движение.Номенклатура = СтрокаПлан.Номенклатура;
		Движение.Количество = СтрокаПлан.Март;
		
		Движение = Движения.ПланПродажМенеджеров.Добавить();
		НомерМесяц = 4;
		Движение.МенеджерПродаж = МенеджерПродаж;
		Движение.Год = Год;
		Движение.Месяц = НачалоМесяца(Дата(Год,НомерМесяц,1,0,0,1));
		Движение.Номенклатура = СтрокаПлан.Номенклатура;
		Движение.Количество = СтрокаПлан.Апрель;
		
		Движение = Движения.ПланПродажМенеджеров.Добавить();
		НомерМесяц = 5;
		Движение.МенеджерПродаж = МенеджерПродаж;
		Движение.Год = Год;
		Движение.Месяц = НачалоМесяца(Дата(Год,НомерМесяц,1,0,0,1));
		Движение.Номенклатура = СтрокаПлан.Номенклатура;
		Движение.Количество = СтрокаПлан.Май;
		
		Движение = Движения.ПланПродажМенеджеров.Добавить();
		НомерМесяц = 6;
		Движение.МенеджерПродаж = МенеджерПродаж;
		Движение.Год = Год;
		Движение.Месяц = НачалоМесяца(Дата(Год,НомерМесяц,1,0,0,1));
		Движение.Номенклатура = СтрокаПлан.Номенклатура;
		Движение.Количество = СтрокаПлан.Июнь;
		
		Движение = Движения.ПланПродажМенеджеров.Добавить();
		НомерМесяц = 7;
		Движение.МенеджерПродаж = МенеджерПродаж;
		Движение.Год = Год;
		Движение.Месяц = НачалоМесяца(Дата(Год,НомерМесяц,1,0,0,1));
		Движение.Номенклатура = СтрокаПлан.Номенклатура;
		Движение.Количество = СтрокаПлан.Июль;
		
		Движение = Движения.ПланПродажМенеджеров.Добавить();
		НомерМесяц = 8;
		Движение.МенеджерПродаж = МенеджерПродаж;
		Движение.Год = Год;
		Движение.Месяц = НачалоМесяца(Дата(Год,НомерМесяц,1,0,0,1));
		Движение.Номенклатура = СтрокаПлан.Номенклатура;
		Движение.Количество = СтрокаПлан.Август;
		
		Движение = Движения.ПланПродажМенеджеров.Добавить();
		НомерМесяц = 9;
		Движение.МенеджерПродаж = МенеджерПродаж;
		Движение.Год = Год;
		Движение.Месяц = НачалоМесяца(Дата(Год,НомерМесяц,1,0,0,1));
		Движение.Номенклатура = СтрокаПлан.Номенклатура;
		Движение.Количество = СтрокаПлан.Сентябрь;
		
		Движение = Движения.ПланПродажМенеджеров.Добавить();
		НомерМесяц = 10;
		Движение.МенеджерПродаж = МенеджерПродаж;
		Движение.Год = Год;
		Движение.Месяц = НачалоМесяца(Дата(Год,НомерМесяц,1,0,0,1));
		Движение.Номенклатура = СтрокаПлан.Номенклатура;
		Движение.Количество = СтрокаПлан.Октябрь;
		
		Движение = Движения.ПланПродажМенеджеров.Добавить();
		НомерМесяц = 11;
		Движение.МенеджерПродаж = МенеджерПродаж;
		Движение.Год = Год;
		Движение.Месяц = НачалоМесяца(Дата(Год,НомерМесяц,1,0,0,1));
		Движение.Номенклатура = СтрокаПлан.Номенклатура;
		Движение.Количество = СтрокаПлан.Ноябрь;
		
		Движение = Движения.ПланПродажМенеджеров.Добавить();
		НомерМесяц = 12;
		Движение.МенеджерПродаж = МенеджерПродаж;
		Движение.Год = Год;
		Движение.Месяц = НачалоМесяца(Дата(Год,НомерМесяц,1,0,0,1));
		Движение.Номенклатура = СтрокаПлан.Номенклатура;
		Движение.Количество = СтрокаПлан.Декабрь;
		
	КонецЦикла;
	
КонецПроцедуры
